Autodesk.Revit.DB.ExportPatternKey.OriginalFillPatternName
The original FillPattern name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportPatternKey.#ctor(Autodesk.Revit.DB.FillPatternTarget,System.String)
Constructs a new ExportPatternKey using the original fill pattern type and name as input.
originalFillPatternType:
The original FillPattern type.
originalFillPatternName:
The original FillPattern name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.ExportPatternKey.#ctor(Autodesk.Revit.DB.ExportPatternKey)
Constructs a new copy of the input ExportPatternKey object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014